11/data/attachments/fe462ab90ecf8862.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_actions_3c5e316d-1a1c-40ba-9390-d47c245c200b</nif:username>
            <nif:friendToBeAdded>Donna_amount_Actions_12874_2</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>